rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_MSCM.h
#define MSCM_ENEDC_ADD_CM7_1_TCM_MASK            (0x20000000U)
#define MSCM_ENEDC_ADD_CM7_1_TCM_SHIFT           (29U)
#define MSCM_ENEDC_ADD_CM7_1_TCM_WIDTH           (1U)
#define MSCM_ENEDC_ADD_CM7_1_TCM(x)              (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC_ADD_CM7_1_TCM_SHIFT)) & MSCM_ENEDC_ADD_CM7_1_TCM_MASK)
/*! @} */

/*! @name ENEDC1 - Enable Interconnect Error Detection */
/*! @{ */

#define MSCM_ENEDC1_EDMA1_MASK                   (0x1U)
#define MSCM_ENEDC1_EDMA1_SHIFT                  (0U)
#define MSCM_ENEDC1_EDMA1_WIDTH                  (1U)
#define MSCM_ENEDC1_EDMA1(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_EDMA1_SHIFT)) & MSCM_ENEDC1_EDMA1_MASK)

#define MSCM_ENEDC1_ZIPWIRE_MASK                 (0x2U)
#define MSCM_ENEDC1_ZIPWIRE_SHIFT                (1U)
#define MSCM_ENEDC1_ZIPWIRE_WIDTH                (1U)
#define MSCM_ENEDC1_ZIPWIRE(x)                   (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_ZIPWIRE_SHIFT)) & MSCM_ENEDC1_ZIPWIRE_MASK)

#define MSCM_ENEDC1_CM7_2_AHBM_MASK              (0x4U)
#define MSCM_ENEDC1_CM7_2_AHBM_SHIFT             (2U)
#define MSCM_ENEDC1_CM7_2_AHBM_WIDTH             (1U)
#define MSCM_ENEDC1_CM7_2_AHBM(x)                (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_CM7_2_AHBM_SHIFT)) & MSCM_ENEDC1_CM7_2_AHBM_MASK)

#define MSCM_ENEDC1_CM7_2_AHBP_MASK              (0x8U)
#define MSCM_ENEDC1_CM7_2_AHBP_SHIFT             (3U)
#define MSCM_ENEDC1_CM7_2_AHBP_WIDTH             (1U)
#define MSCM_ENEDC1_CM7_2_AHBP(x)                (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_CM7_2_AHBP_SHIFT)) & MSCM_ENEDC1_CM7_2_AHBP_MASK)

#define MSCM_ENEDC1_PFLASH_3_MASK                (0x10U)
#define MSCM_ENEDC1_PFLASH_3_SHIFT               (4U)
#define MSCM_ENEDC1_PFLASH_3_WIDTH               (1U)
#define MSCM_ENEDC1_PFLASH_3(x)                  (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_PFLASH_3_SHIFT)) & MSCM_ENEDC1_PFLASH_3_MASK)

#define MSCM_ENEDC1_EDMA_S0_MASK                 (0x20U)
#define MSCM_ENEDC1_EDMA_S0_SHIFT                (5U)
#define MSCM_ENEDC1_EDMA_S0_WIDTH                (1U)
#define MSCM_ENEDC1_EDMA_S0(x)                   (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_EDMA_S0_SHIFT)) & MSCM_ENEDC1_EDMA_S0_MASK)

#define MSCM_ENEDC1_EDMA_S1_MASK                 (0x40U)
#define MSCM_ENEDC1_EDMA_S1_SHIFT                (6U)
#define MSCM_ENEDC1_EDMA_S1_WIDTH                (1U)
#define MSCM_ENEDC1_EDMA_S1(x)                   (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_EDMA_S1_SHIFT)) & MSCM_ENEDC1_EDMA_S1_MASK)

#define MSCM_ENEDC1_EDMA1_S0_MASK                (0x80U)
#define MSCM_ENEDC1_EDMA1_S0_SHIFT               (7U)
#define MSCM_ENEDC1_EDMA1_S0_WIDTH               (1U)
#define MSCM_ENEDC1_EDMA1_S0(x)                  (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_EDMA1_S0_SHIFT)) & MSCM_ENEDC1_EDMA1_S0_MASK)

#define MSCM_ENEDC1_EDMA1_S1_MASK                (0x100U)
#define MSCM_ENEDC1_EDMA1_S1_SHIFT               (8U)
#define MSCM_ENEDC1_EDMA1_S1_WIDTH               (1U)
#define MSCM_ENEDC1_EDMA1_S1(x)                  (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_EDMA1_S1_SHIFT)) & MSCM_ENEDC1_EDMA1_S1_MASK)

#define MSCM_ENEDC1_AIPS3_MASK                   (0x1000U)
#define MSCM_ENEDC1_AIPS3_SHIFT                  (12U)
#define MSCM_ENEDC1_AIPS3_WIDTH                  (1U)
#define MSCM_ENEDC1_AIPS3(x)                     (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_AIPS3_SHIFT)) & MSCM_ENEDC1_AIPS3_MASK)

#define MSCM_ENEDC1_ADD_AIPS3_MASK               (0x2000U)
#define MSCM_ENEDC1_ADD_AIPS3_SHIFT              (13U)
#define MSCM_ENEDC1_ADD_AIPS3_WIDTH              (1U)
#define MSCM_ENEDC1_ADD_AIPS3(x)                 (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_ADD_AIPS3_SHIFT)) & MSCM_ENEDC1_ADD_AIPS3_MASK)

#define MSCM_ENEDC1_CM7_2_TCM_MASK               (0x4000U)
#define MSCM_ENEDC1_CM7_2_TCM_SHIFT              (14U)
#define MSCM_ENEDC1_CM7_2_TCM_WIDTH              (1U)
#define MSCM_ENEDC1_CM7_2_TCM(x)                 (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_CM7_2_TCM_SHIFT)) & MSCM_ENEDC1_CM7_2_TCM_MASK)

#define MSCM_ENEDC1_ADD_CM7_2_TCM_MASK           (0x8000U)
#define MSCM_ENEDC1_ADD_CM7_2_TCM_SHIFT          (15U)
#define MSCM_ENEDC1_ADD_CM7_2_TCM_WIDTH          (1U)
#define MSCM_ENEDC1_ADD_CM7_2_TCM(x)             (((uint32_t)(((uint32_t)(x)) << MSCM_ENEDC1_ADD_CM7_2_TCM_SHIFT)) & MSCM_ENEDC1_ADD_CM7_2_TCM_MASK)
/*! @} */

/*! @name IRSPRC - Interrupt Router Shared Peripheral Routing Control */
/*! @{ */

#define MSCM_IRSPRC_M7_0_MASK                    (0x1U)
#define MSCM_IRSPRC_M7_0_SHIFT                   (0U)
#define MSCM_IRSPRC_M7_0_WIDTH                   (1U)
#define MSCM_IRSPRC_M7_0(x)                      (((uint16_t)(((uint16_t)(x)) << MSCM_IRSPRC_M7_0_SHIFT)) & MSCM_IRSPRC_M7_0_MASK)

#define MSCM_IRSPRC_M7_1_MASK                    (0x2U)
#define MSCM_IRSPRC_M7_1_SHIFT                   (1U)
#define MSCM_IRSPRC_M7_1_WIDTH                   (1U)
#define MSCM_IRSPRC_M7_1(x)                      (((uint16_t)(((uint16_t)(x)) << MSCM_IRSPRC_M7_1_SHIFT)) & MSCM_IRSPRC_M7_1_MASK)

#define MSCM_IRSPRC_M7_2_MASK                    (0x4U)
#define MSCM_IRSPRC_M7_2_SHIFT                   (2U)
#define MSCM_IRSPRC_M7_2_WIDTH                   (1U)
#define MSCM_IRSPRC_M7_2(x)                      (((uint16_t)(((uint16_t)(x)) << MSCM_IRSPRC_M7_2_SHIFT)) & MSCM_IRSPRC_M7_2_MASK)

#define MSCM_IRSPRC_LOCK_MASK                    (0x8000U)
#define MSCM_IRSPRC_LOCK_SHIFT                   (15U)
#define MSCM_IRSPRC_LOCK_WIDTH                   (1U)
#define MSCM_IRSPRC_LOCK(x)                      (((uint16_t)(((uint16_t)(x)) << MSCM_IRSPRC_LOCK_SHIFT)) & MSCM_IRSPRC_LOCK_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group MSCM_Register_Masks */

/*!
 * @}
 */ /* end of group MSCM_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K37_MSCM_H_) */
